'use client'

import Container from '@/components/UI/Container/Container'
import React from 'react'

type Props = {}

function Contacts({}: Props) {
  return (
    <Container>
        <div className='flex flex-col gap-[40px] xs:gap-[60px] m:gap-[80px] w-full py-[40px] xs:py-[60px] m:py-[80px]'>
            <div className='flex flex-col gap-[20px]'>
                <h2 className='text-u-h2 uppercase font-bold'>Связаться с нами</h2>

            </div>
            <div className='flex flex-col gap-[15px] xs:gap-[30px]'>
                <div className='flex flex-col'>
                    <h2 className='text-u-h2 uppercase font-bold text-prim3'>+7 (985) 425-16-36</h2>
                    <p>Телефон</p>
                </div>
                <div className='flex flex-col'>
                    <h2 className='text-u-h2 uppercase font-bold'>@Matalex_Perf</h2>
                    <p>Телеграм для связи</p>
                </div>
                <div className='flex flex-col'>
                    <h2 className='text-u-h2 uppercase font-bold'>Москва, Советская ул., 80, стр. 9</h2>
                    <p>Адрес</p>
                </div>
                <div className='flex flex-col gap-[5px]'>
                    <div className='flex items-center gap-[17px]'>
                    <div className='cursor-pointer w-[32px] xs:w-[48px]'><svg viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M3.36 3.36C6.35783e-07 6.752 0 12.176 0 23.04V24.96C0 35.808 6.35783e-07 41.232 3.36 44.64C6.752 48 12.176 48 23.04 48H24.96C35.808 48 41.232 48 44.64 44.64C48 41.248 48 35.824 48 24.96V23.04C48 12.192 48 6.768 44.64 3.36C41.248 6.35783e-07 35.824 0 24.96 0H23.04C12.192 0 6.768 6.35783e-07 3.36 3.36ZM8.096 14.608H13.6C13.776 23.76 17.808 27.632 21.008 28.432V14.608H26.176V22.496C29.328 22.16 32.656 18.56 33.776 14.592H38.928C38.5081 16.6461 37.669 18.5915 36.4632 20.3066C35.2574 22.0217 33.7108 23.4697 31.92 24.56C33.9185 25.5543 35.6834 26.9612 37.0983 28.6877C38.5131 30.4142 39.5457 32.4211 40.128 34.576H34.448C33.232 30.784 30.192 27.84 26.176 27.44V34.576H25.536C14.592 34.576 8.352 27.088 8.096 14.608Z" fill="#51BEF9"/>
                    </svg></div>
                    <div className='cursor-pointer w-[34px] xs:w-[54px]'><svg viewBox="0 0 54 54" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M27.0007 0.333008C12.2807 0.333008 0.333984 12.2797 0.333984 26.9997C0.333984 41.7197 12.2807 53.6663 27.0007 53.6663C41.7207 53.6663 53.6673 41.7197 53.6673 26.9997C53.6673 12.2797 41.7207 0.333008 27.0007 0.333008ZM39.374 18.4663C38.974 22.6797 37.2407 32.9197 36.3607 37.6397C35.9873 39.6397 35.2407 40.3063 34.5473 40.3863C33.0007 40.5197 31.8273 39.373 30.334 38.3863C27.9873 36.8397 26.654 35.8797 24.3873 34.3863C21.7473 32.653 23.454 31.693 24.974 30.1463C25.374 29.7463 32.2007 23.533 32.334 22.973C32.3525 22.8882 32.35 22.8001 32.3268 22.7165C32.3036 22.6328 32.2603 22.5561 32.2007 22.493C32.0407 22.3597 31.8273 22.413 31.6407 22.4397C31.4007 22.493 27.6673 24.973 20.3873 29.8797C19.3207 30.5997 18.3607 30.973 17.5073 30.9463C16.5473 30.9197 14.734 30.413 13.374 29.9597C11.694 29.4263 10.3873 29.133 10.494 28.1997C10.5473 27.7197 11.214 27.2397 12.4673 26.733C20.254 23.3463 25.4273 21.1063 28.014 20.0397C35.4273 16.9463 36.9473 16.413 37.9607 16.413C38.174 16.413 38.6807 16.4663 39.0007 16.733C39.2673 16.9463 39.3473 17.2397 39.374 17.453C39.3473 17.613 39.4007 18.093 39.374 18.4663Z" fill="#51BEF9"/>
                    </svg></div>
                    <div className='cursor-pointer w-[44px] xs:w-[54px]'><svg viewBox="0 0 54 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M21.6673 26.9997L35.5073 18.9997L21.6673 10.9997V26.9997ZM52.494 6.11967C52.8407 7.37301 53.0807 9.05301 53.2407 11.1863C53.4273 13.3197 53.5073 15.1597 53.5073 16.7597L53.6673 18.9997C53.6673 24.8397 53.2407 29.133 52.494 31.8797C51.8273 34.2797 50.2807 35.8263 47.8807 36.493C46.6273 36.8397 44.334 37.0797 40.814 37.2397C37.3473 37.4263 34.174 37.5063 31.2407 37.5063L27.0007 37.6663C15.8273 37.6663 8.86732 37.2397 6.12065 36.493C3.72065 35.8263 2.17398 34.2797 1.50732 31.8797C1.16065 30.6263 0.920651 28.9463 0.760651 26.813C0.573985 24.6797 0.493984 22.8397 0.493984 21.2397L0.333984 18.9997C0.333984 13.1597 0.760651 8.86634 1.50732 6.11967C2.17398 3.71967 3.72065 2.17301 6.12065 1.50634C7.37398 1.15967 9.66732 0.919674 13.1873 0.759674C16.654 0.573007 19.8273 0.493008 22.7607 0.493008L27.0007 0.333008C38.174 0.333008 45.134 0.759675 47.8807 1.50634C50.2807 2.17301 51.8273 3.71967 52.494 6.11967Z" fill="#51BEF9"/>
                    </svg></div>
                    </div>
                    <p>Следите за нами</p>
                </div>
                <div className='flex flex-col xxs:flex-row xxs:items-center gap-[30px]'>
                    <div className='flex flex-col'>
                        <p className='text-u-h4 font-bold text-gray5'>9719064987</p>
                        <p className='text-i-p2 text-gray4'>ИНН</p>
                    </div>
                    <div className='flex flex-col'>
                        <p className='text-u-h4 font-bold text-gray5'>1247700202056</p>
                        <p className='text-i-p2 text-gray4'>ОГРН</p>
                    </div>
                    <div className='flex flex-col'>
                        <p className='text-u-h4 font-bold text-gray5'>“МАТАЛЕКС ТЕХНОЛОДЖИ”</p>
                        <p className='text-i-p2 text-gray4'>ООО</p>
                    </div>
                </div>
            </div>
        </div>
    </Container>
  )
}

export default Contacts